---
kind: method
id: M:Autodesk.Revit.DB.Form.IsReferenceOnlyProfile(System.Int32)
zh: 对话框、窗口、窗体
source: html/46e4fe02-ccb4-fb95-87bd-8312eba27e5d.htm
---
# Autodesk.Revit.DB.Form.IsReferenceOnlyProfile Method

**中文**: 对话框、窗口、窗体

Tell if the profile is made by referencing existing geometry in the Revit model.

## Syntax (C#)
```csharp
public bool IsReferenceOnlyProfile(
	int profileIndex
)
```

## Parameters
- **profileIndex** (`System.Int32`) - Index to specify the profile to be checked.